# @crescentrose's currently used apps and utilities.
#

tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# 💻 General {{{

# World's greatest terminal emulator.
cask "kitty"
# Unix shell (command interpreter)
brew "zsh"

# GNU Transport Layer Security (TLS) Library. Required for signing Git commits.
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package. Required for signing Git commits.
brew "gnupg"

# Simple CLI interface for the Mac App Store
brew "mas"

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Music streaming service
cask "spotify"
# Fill and save your passwords
mas "1Password for Safari", id: 1569813296
# Adblock and privacy
mas "AdGuard for Safari", id: 1440147259
# Edit documents, notes and ideas
mas "Craft", id: 1487937127
# Hide menubar items
mas "Hidden Bar", id: 1452453066
# Organize Your Workspace
mas "Magnet", id: 441258766
# Beautiful images
mas "Unsplash Wallpapers", id: 1284863847

# Free monospaced font with programming ligatures
cask "font-fira-code"

# }}}

# 🔧 CLI utilities {{{

# A cat(1) clone with wings.
brew "bat"
# 🌸 A command-line fuzzy finder
brew "fzf"
# Improved top (interactive process viewer)
brew "htop"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Git large file support
brew "git-lfs"

# }}}

# 💎 Development - Languages, Databases {{{

# Command-line interface for SQLite
brew "sqlite"
# Object-relational database system
brew "postgresql@14"

# Interpreted, interactive, object-oriented programming language
brew "python"
# Fast and simple Node.js version manager
brew "fnm"
# Ruby version manager
brew "rbenv"
# Open source programming language to build simple/reliable/efficient software
brew "go"

# }}}

# 🐳 Docker, you used to be so simple... {{{

# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Toolkit for embedding hypervisor capabilities in your application. Required
# for minikube.
brew "hyperkit"
# Run a Kubernetes cluster locally.
brew "minikube"

# }}}

# 🔨 Development tools {{{

# Utility that creates projects from templates
brew "cookiecutter"
# GitHub command-line tool
brew "gh"

# vim
brew "vim"
# Open-source code editor
cask "visual-studio-code"

# }}}

# ☁ Cloud development {{{

# OpenShift command-line interface tools
brew "openshift-cli"
# Terraform enables you to safely and predictably create, change, and improve
# infrastructure
brew "hashicorp/tap/terraform"
# Manage Secrets & Protect Sensitive Data
brew "hashicorp/tap/vault"
# The Kubernetes Package Manager
brew "helm"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"

# }}}

# vim: fdm=marker fdl=0
